artillery-test.yml
config:
  target: "http://localhost:5002"  # Change to your Railway URL for production testing
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up - 5 users per second"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load - 10 users per second"
    - duration: 60
      arrivalRate: 20
      name: "Peak load - 20 users per second"
  
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # Test 1: Browse Products (40% of traffic)
  - name: "Browse Products"
    weight: 40
    flow:
      - get:
          url: "/api/products"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/categories"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/api/products?page=1&limit=12"
          expect:
            - statusCode: 200

  # Test 2: Product Details & Reviews (30% of traffic)
  - name: "View Product Details"
    weight: 30
    flow:
      - get:
          url: "/api/products"
          capture:
            - json: "$.products[0]._id"
              as: "productId"
      - think: 1
      - get:
          url: "/api/products/{{ productId }}"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/api/reviews/product/{{ productId }}"

  # Test 3: User Registration & Login (20% of traffic)
  - name: "User Authentication"
    weight: 20
    flow:
      - post:
          url: "/api/auth/register"
          json:
            name: "Test User {{ $randomString() }}"
            email: "test{{ $randomNumber(1000, 9999) }}@example.com"
            password: "Test123456"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 2
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@youssefezzat764@gmail.com"
            password: "123456789"
          expect:
            - statusCode: 200

  # Test 4: Shopping Cart Operations (10% of traffic)
  - name: "Cart Operations"
    weight: 10
    flow:
      # Login first
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@youssefezzat764@gmail.com"
            password: "123456789"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1
      # Get cart
      - get:
          url: "/api/cart"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - think: 2
      # Get wishlist
      - get:
          url: "/api/wishlist"
          headers:
            Authorization: "Bearer {{ authToken }}"

  # Test 5: Admin Dashboard (5% of traffic - admins only)
  - name: "Admin Operations"
    weight: 5
    flow:
      # Admin login
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@youssefezzat764@gmail.com"
            password: "123456789"
          capture:
            - json: "$.token"
              as: "adminToken"
      - think: 1
      # Get dashboard stats
      - get:
          url: "/api/admin/dashboard/stats"
          headers:
            Authorization: "Bearer {{ adminToken }}"
      - think: 2
      # Get all products
      - get:
          url: "/api/admin/products"
          headers:
            Authorization: "Bearer {{ adminToken }}"
      - think: 1
      # Get categories
      - get:
          url: "/api/admin/categories"
          headers:
            Authorization: "Bearer {{ adminToken }}"